In [31]:
import pandas as pd
import numpy as np
import os
import glob

In [32]:
path = 'C://Users/Laveena/Desktop/Laveena_all_folders/Projects/Supply Chain ATLIQ mart/Atliq-Mart-Supply-Chain-Dashboard'
extension = 'csv'
os.chdir(path)
result = glob.glob(f'*.{extension}')
print(result)

['dim_customers.csv', 'dim_products.csv', 'dim_targets_orders.csv', 'fact_orders_aggregate.csv', 'fact_order_lines.csv']

In [33]:
customers = pd.read_csv(result[0])
products = pd.read_csv(result[1])
target_orders = pd.read_csv(result[2])
orders_aggregate = pd.read_csv(result[3])
order_lines = pd.read_csv(result[4])

In [34]:
customers.head(3)

   customer_id customer_name       city
0       789201     Rel Fresh      Surat
1       789202     Rel Fresh  Ahmedabad
2       789203     Rel Fresh   Vadodara

In [35]:
products.head(3)

# split product name into "product" and "variant"

  product_name  product_id category
0  AM Milk 500    25891101    Dairy
1  AM Milk 250    25891102    Dairy
2  AM Milk 100    25891103    Dairy

In [36]:
target_orders.head(3)

# Rename columns

   customer_id  ontime_target%  infull_target%  otif_target%
0       789201              87              81            70
1       789202              85              81            69
2       789203              92              76            70

In [37]:
orders_aggregate.head(3)

# changE date format

      order_id  customer_id order_placement_date  on_time  in_full  otif
0  FMR32103503       789103            01-Mar-22        1        0     0
1  FMR34103403       789103            01-Mar-22        1        0     0
2  FMR32103602       789103            01-Mar-22        1        0     0

In [38]:
order_lines.head(3)

# change the date formats
# Rename columns

,order_id,order_placement_date,customer_id,product_id,order_qty,agreed_delivery_date,actual_delivery_date,delivery_qty,In Full,On Time,On Time In Full
0,FMR34203601,"Tuesday, March 1, 2022",789203,25891601,110,"Friday, March 4, 2022","Friday, March 4, 2022",110,1,1,1
1,FMR32320302,"Tuesday, March 1, 2022",789320,25891203,347,"Wednesday, March 2, 2022","Wednesday, March 2, 2022",347,1,1,1
2,FMR33320501,"Tuesday, March 1, 2022",789320,25891203,187,"Thursday, March 3, 2022","Thursday, March 3, 2022",150,0,1,0

## FIXING COLUMNS

***Changing to standard datetime column***

In [39]:
orders_aggregate["order_placement_date"] = pd.to_datetime(orders_aggregate["order_placement_date"])

C:\Users\Laveena\AppData\Local\Temp\ipykernel_31596\879130646.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  orders_aggregate["order_placement_date"] = pd.to_datetime(orders_aggregate["order_placement_date"])

In [40]:
order_lines["agreed_delivery_date"] = pd.to_datetime(order_lines["agreed_delivery_date"])
order_lines["actual_delivery_date"] = pd.to_datetime(order_lines["actual_delivery_date"])
order_lines["order_placement_date"] = pd.to_datetime(order_lines["order_placement_date"])

In [41]:
orders_aggregate.head(3)

      order_id  customer_id order_placement_date  on_time  in_full  otif
0  FMR32103503       789103           2022-03-01        1        0     0
1  FMR34103403       789103           2022-03-01        1        0     0
2  FMR32103602       789103           2022-03-01        1        0     0

In [42]:
order_lines.head(3)

,order_id,order_placement_date,customer_id,product_id,order_qty,agreed_delivery_date,actual_delivery_date,delivery_qty,In Full,On Time,On Time In Full
0,FMR34203601,2022-03-01,789203,25891601,110,2022-03-04,2022-03-04,110,1,1,1
1,FMR32320302,2022-03-01,789320,25891203,347,2022-03-02,2022-03-02,347,1,1,1
2,FMR33320501,2022-03-01,789320,25891203,187,2022-03-03,2022-03-03,150,0,1,0

***Splitting Product Name Column***

In [43]:
products["product"] = products["product_name"].str.split(" ").str[1]
products["variant"] = products["product_name"].str.split(" ").str[2]

In [44]:
products.drop(columns = "product_name", inplace = True)

In [45]:
products.head(3)

   product_id category product variant
0    25891101    Dairy    Milk     500
1    25891102    Dairy    Milk     250
2    25891103    Dairy    Milk     100

***Renaming columns of order_lines with underscores***

In [46]:
order_lines.rename(columns = {"In Full":"in_full",
                             "On Time":"on_time",
                             "On Time In Full":"otif"}, inplace = True)

In [47]:
target_orders.rename(columns = {"ontime_target%":"ontime_target_percentage",
                             "infull_target%":"infull_target_percentage",
                             "otif_target%":"otif_target_percentage"}, inplace = True)

***CONVERTING INTO AN EXCEL FILE***

In [48]:
with pd.ExcelWriter("atliq_mart.xlsx") as writer:
   
    # use to_excel function and specify the sheet_name and index 
    # to store the dataframe in specified sheet
    customers.to_excel(writer, sheet_name="customers", index=False)
    products.to_excel(writer, sheet_name="products", index=False)
    target_orders.to_excel(writer, sheet_name="target_orders", index=False)
    order_lines.to_excel(writer, sheet_name="order_lines", index=False)
    orders_aggregate.to_excel(writer, sheet_name="orders_aggregate", index=False)